fabrika/src/Documents/КорректировкаЗадолженностей/КорректировкаЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЗадолженностей</name>
  <registerRecords>AccumulationRegister.ТаможняВзаимозадолженности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

fabrika/src/Documents/КорректировкаЗадолженностей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДоговорыКонтрагентовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ДоговорПоОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = ПолучитьПараметрыВыбора(Объект.Организация, Объект.Контрагент);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыбора(Организация, Контрагент)

	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Справочники.Организации.НайтиПоРеквизиту("ИНН", Контрагент.ИНН));
	Отбор.Вставить("Владелец", Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Организация.ИНН));
	
	ПараметрыОткрытия = Новый Структура("Отбор", Отбор);
	
	Возврат ПараметрыОткрытия;
	

КонецФункции
